{
  "metadata": {
    "name": "my_lora_dataset",
    "custom_tag": "reggaeton",
    "tag_position": "replace",
    "created_at": "2026-02-10T16:40:09.711345",
    "num_samples": 8,
    "all_instrumental": true,
    "genre_ratio": 0
  },
  "samples": [
    {
      "id": "01e8523a",
      "audio_path": "./my_audio/beat1.mp3",
      "filename": "beat1.mp3",
      "caption": "An aggressive, high-energy dembow track driven by a relentless, pounding drum machine beat and a raw, shouted male vocal performance. The arrangement is built on heavily processed and chopped vocal samples, including a recurring, stuttering hook of 'pura caracara'. The production is loud and compressed, featuring turntable scratch effects and a brief, echo-laden spoken word interlude that builds tension before slamming back into the intense, percussive groove.",
      "genre": "Dembow",
      "lyrics": "[Instrumental]",
      "raw_lyrics": "",
      "formatted_lyrics": "",
      "bpm": 94,
      "keyscale": "C# major",
      "timesignature": "4",
      "duration": 126,
      "language": "unknown",
      "is_instrumental": true,
      "custom_tag": "reggaeton",
      "labeled": true,
      "prompt_override": null
    },
    {
      "id": "28234a41",
      "audio_path": "./my_audio/beat2.mp3",
      "filename": "beat2.mp3",
      "caption": "An energetic, instrumental reggaeton track driven by a classic dembow drum machine beat and a punchy synth bassline. The arrangement is built around layers of bright, catchy synthesizers, including a main melodic lead and various arpeggiated patterns that keep the momentum high. The track features several dynamic shifts, including a brief breakdown where the beat drops out for a more melodic, almost chiptune-like synth section before slamming back into the full, driving groove. The production is clean and modern, designed for a high-energy dancefloor experience.",
      "genre": "Reggaeton",
      "lyrics": "[Instrumental]",
      "raw_lyrics": "",
      "formatted_lyrics": "",
      "bpm": 94,
      "keyscale": "E minor",
      "timesignature": "4",
      "duration": 126,
      "language": "unknown",
      "is_instrumental": true,
      "custom_tag": "reggaeton",
      "labeled": true,
      "prompt_override": null
    },
    {
      "id": "bceb1452",
      "audio_path": "./my_audio/beat3.mp3",
      "filename": "beat3.mp3",
      "caption": "An energetic, instrumental reggaeton track with a strong chiptune and video game influence. The song opens with a catchy, arpeggiated synth lead reminiscent of 8-bit video game music, layered over a driving dembow drum machine beat and a deep sub-bass. The arrangement is dynamic, featuring sections with melodic piano chords, playful synth fills, and brief, sampled vocal shouts used as rhythmic accents. The track builds with synth risers and incorporates turntable scratch effects for texture, maintaining a high-energy, danceable groove throughout before ending abruptly after a final synth flourish.",
      "genre": "Reggaeton chiptune",
      "lyrics": "[Instrumental]",
      "raw_lyrics": "",
      "formatted_lyrics": "",
      "bpm": 94,
      "keyscale": "F# minor",
      "timesignature": "4",
      "duration": 154,
      "language": "unknown",
      "is_instrumental": true,
      "custom_tag": "reggaeton",
      "labeled": true,
      "prompt_override": null
    },
    {
      "id": "0c4a981e",
      "audio_path": "./my_audio/beat4.mp3",
      "filename": "beat4.mp3",
      "caption": "An aggressive, high-energy Latin electronic track driven by a relentless reggaeton-style drum machine beat and a catchy, staccato synth horn melody that serves as the main hook. The male vocals are delivered in a rapid-fire, almost shouted Spanish rap style, layered with hype-man ad-libs and processed with noticeable reverb and delay. The production is dense with electronic elements, including turntable scratch effects, synth risers, and vocal chops that punctuate the arrangement. The track maintains a frantic, dance-floor-ready energy throughout, with brief breakdowns that feature filtered vocals and rhythmic vocalizations before slamming back into the full-throttle groove.",
      "genre": "Reggaeton",
      "lyrics": "[Instrumental]",
      "raw_lyrics": "",
      "formatted_lyrics": "",
      "bpm": 94,
      "keyscale": "C# major",
      "timesignature": "4",
      "duration": 146,
      "language": "unknown",
      "is_instrumental": true,
      "custom_tag": "reggaeton",
      "labeled": true,
      "prompt_override": null
    },
    {
      "id": "1777a670",
      "audio_path": "./my_audio/beat5.mp3",
      "filename": "beat5.mp3",
      "caption": "An aggressive, high-energy electronic track driven by a relentless, distorted synth bassline and a hard-hitting drum machine beat. The arrangement is built on layers of chiptune-style arpeggios and sawtooth synth leads that carry the main melodic motifs. The track progresses through a series of intense build-ups and powerful drops, characteristic of hardstyle and electro house. A significant breakdown occurs midway, stripping away the beat to feature atmospheric synth pads and a melodic arpeggio, creating a brief moment of calm before a massive riser and filter sweep build tension and launch the track back into its full-throttle climax.",
      "genre": "Hardstyle electro house",
      "lyrics": "[Instrumental]",
      "raw_lyrics": "",
      "formatted_lyrics": "",
      "bpm": 94,
      "keyscale": "B minor",
      "timesignature": "4",
      "duration": 124,
      "language": "unknown",
      "is_instrumental": true,
      "custom_tag": "reggaeton",
      "labeled": true,
      "prompt_override": null
    },
    {
      "id": "8e58ad6a",
      "audio_path": "./my_audio/beat6.mp3",
      "filename": "beat6.mp3",
      "caption": "An aggressive, high-energy instrumental track built on a foundation of hard-hitting, distorted kick drums and sharp, metallic snares. The arrangement is driven by a relentless, percussive groove characteristic of hard dembow or dembow, punctuated by a recurring, alarm-like synth stab and siren-like FX. The track builds tension through intense rhythmic sections, brief atmospheric breakdowns featuring filtered pads and risers, and rapid-fire drum fills that slam back into the main pounding beat. The production is loud and heavily compressed, with a raw, in-your-face quality perfect for a high-intensity club or workout setting.",
      "genre": "Hard dembow",
      "lyrics": "[Instrumental]",
      "raw_lyrics": "",
      "formatted_lyrics": "",
      "bpm": 94,
      "keyscale": "E minor",
      "timesignature": "4",
      "duration": 129,
      "language": "unknown",
      "is_instrumental": true,
      "custom_tag": "reggaeton",
      "labeled": true,
      "prompt_override": null
    },
    {
      "id": "20eff0c4",
      "audio_path": "./my_audio/beat7.mp3",
      "filename": "beat7.mp3",
      "caption": "An energetic and percussive instrumental track built on a driving dembow rhythm with hard-hitting kicks and sharp snares. The main hook is carried by a quirky, synthesized vocal chop that mimics an animalistic howl or screech sample, creating a playful yet intense atmosphere reminiscent of Dutch House or hardstyle rhythms. The arrangement features dynamic builds using synth risers and filter sweeps, dropping into powerful rhythmic sections punctuated by DJ scratch effects and tape-stop transitions. A brief melodic interlude introduces marimba-like synths before returning to its core infectious groove.",
      "genre": "Dembow",
      "lyrics": "[Instrumental]",
      "raw_lyrics": "",
      "formatted_lyrics": "",
      "bpm": 94,
      "keyscale": "G major",
      "timesignature": "4",
      "duration": 124,
      "language": "unknown",
      "is_instrumental": true,
      "custom_tag": "reggaeton",
      "labeled": true,
      "prompt_override": null
    },
    {
      "id": "3060117b",
      "audio_path": "./my_audio/beat8.mp3",
      "filename": "beat8.mp3",
      "caption": "An aggressive, high-energy instrumental track driven by a powerful dembow-style drum machine beat with sharp snares and intricate hi-hat patterns. A deep sub-bass synth anchors the rhythm while layered synthesizers provide melodic content. The main hook is carried by a distinctive lead synth playing an Arabic-scale melody, giving the track an exotic flair. The arrangement builds through dynamic layering, introducing new percussive elements like bongos and claps to intensify the driving groove before breaking down into sections that highlight the chiptune-esque synth melodies. The overall mood is intense, hypnotic, and perfect for dancing or action sequences.",
      "genre": "Dembow",
      "lyrics": "[Instrumental]",
      "raw_lyrics": "",
      "formatted_lyrics": "",
      "bpm": 94,
      "keyscale": "F minor",
      "timesignature": "4",
      "duration": 124,
      "language": "unknown",
      "is_instrumental": true,
      "custom_tag": "reggaeton",
      "labeled": true,
      "prompt_override": null
    }
  ]
}
